Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ1024EFE064.PIC
      <edc:SFRDef edc:_addr="0x1F860580" edc:_begin="0x10" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="--------------------------nnn-nn" edc:cname="CNENF" edc:desc="" edc:grp="PORTF" edc:impl="0xffc0003b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000-00" edc:name="CNENF" edc:nzwidth="0x20" edc:por="--------------------------000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEF0" edc:desc="" edc:mask="0x1" edc:name="CNIEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF1" edc:desc="" edc:mask="0x1" edc:name="CNIEF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF3" edc:desc="" edc:mask="0x1" edc:name="CNIEF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF4" edc:desc="" edc:mask="0x1" edc:name="CNIEF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF5" edc:desc="" edc:mask="0x1" edc:name="CNIEF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860590" edc:_begin="0x10" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="--------------------------nnn-nn" edc:cname="CNSTATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff003b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000-00" edc:name="CNSTATF" edc:nzwidth="0x20" edc:por="--------------------------000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATF0" edc:desc="" edc:mask="0x1" edc:name="CNSTATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF1" edc:desc="" edc:mask="0x1" edc:name="CNSTATF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF3" edc:desc="" edc:mask="0x1" edc:name="CNSTATF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF4" edc:desc="" edc:mask="0x1" edc:name="CNSTATF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF5" edc:desc="" edc:mask="0x1" edc:name="CNSTATF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8605A0" edc:_begin="0x10" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="--------------------------nnn-nn" edc:cname="CNNEF" edc:desc="" edc:impl="0x3b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000-00" edc:name="CNNEF" edc:nzwidth="32" edc:por="--------------------------000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEF0" edc:mask="0x1" edc:name="CNNEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF1" edc:mask="0x1" edc:name="CNNEF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEF3" edc:mask="0x1" edc:name="CNNEF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF4" edc:mask="0x1" edc:name="CNNEF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF5" edc:mask="0x1" edc:name="CNNEF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8605B0" edc:_begin="0x10" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="--------------------------nnn-nn" edc:cname="CNFF" edc:desc="" edc:impl="0x3b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000-00" edc:name="CNFF" edc:nzwidth="32" edc:por="--------------------------000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFF0" edc:mask="0x1" edc:name="CNFF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF1" edc:mask="0x1" edc:name="CNFF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFF3" edc:mask="0x1" edc:name="CNFF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF4" edc:mask="0x1" edc:name="CNFF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF5" edc:mask="0x1" edc:name="CNFF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
